"""
-------------------------------------------------
  @Time : 2020/3/29 13:35 
  @Auth : 十七
  @File : homework_0327.py
  @IDE  : PyCharm
  @Motto: ABC(Always Be Coding)
  @Email: 1941816343@qq.com
-------------------------------------------------
"""

# 一、必做题
# 1.请写出if判断语句的格式
# if 要判断的条件:
#       条件成立时，要做的事情

# 2.break和continue的区别
# break 是跳出循环，整个循环结束
# continue是跳出本次循环,整个循环不会结束

# 3.求三个整数中的最大值
# 提示：
#
# 	a.三个整数使用input提示用户输入
#
# 	b.上一次已经做过了，本题可不提交

# 上期已提交过

# 4.判断是否为闰年
# 提示:
# a.输入一个有效的年份（如：2019），判断是否为闰年
while True:
    year = int(input("请输入一个有效的年份:"))
    if year % 400 == 0:
        print(f"{year}是闰年")
    elif year % 4 == 0 and year % 100 != 0:
        print(f"{year}是闰年")
    else:
        print(f"{year}是平年")
        break
# b.润年的判断规则，请自行“撩度娘”
# 符合规则1或者规则2，为润年：
# 1. 能被4整除但是不能被100整除
# 2. 能被400整除

# c.如果是闰年，则打印“2019年是闰年”；否则打印“2019年不是闰年”
# while True:
    year = int(input("请输入一个有效的年份:"))
    if year % 400 == 0:
        print(f"2019是闰年")
    elif year % 4 == 0 and year % 100 != 0:
        print(f"2019是闰年")
    else:
        print(f"2019不是闰年")
        break
# 5.编写如下程序
# a.用户输入1-7七个数字，分别代表周一到周日
# 第一种方法
# week_list = ["周一", "周二", "周三", "周四", "周五", "周末", "周末"]
# num = int(input("请输入1~7以内的数字:"))
# print(f"今天是{week_list[num-1]}")
# 第二种方法
weekend = ["周一", "周二", "周三", "周四", "周五", "周六", "周日"]
while True:
    day = input("请输入1-7中的任意数字,输入0退出:")
    # b.如果输入1~5，打印对应的“周一”~“周五”，如果输入的数字是6或7，打印输出“周末”
    if day.isdigit():
        day = int(day)
        if  day == 6 or day == 7:
            print(f"今天是周末")
        elif day in range(1, 6):
            print(f"今天是{weekend[day-1]}")
    # c.如果输入0，退出循环
        elif day == 0:
            break
# # d.输入其他内容，提示：“输入有误，请重新输入！”
    else:
        print("输入有误,请重新输入！")
# 提示：本题可以使用if和while循环

# 6.使用思维导图总结最近几次课的知识点
# 百度脑图链接：http://naotu.baidu.com/file/621cfa4ee243579da2fe347467b93679?token=f3aa7bcd555abc92
#
# 二、选作题
# 1.使用while打印九九乘法表
# 提示：
# 输出九九乘法表，格式如下：
# 1 * 1 = 1
# 1 * 2 = 2 2 * 2 = 4
# 1 * 3 = 3 2 * 3 = 6 3 * 3 = 9
# 1 * 4 = 4 2 * 4 = 8 3 * 4 = 12 4 * 4 = 16
# 1 * 5 = 5 2 * 5 = 10 3 * 5 = 15 4 * 5 = 20 5 * 5 = 25
# 1 * 6 = 6 2 * 6 = 12 3 * 6 = 18 4 * 6 = 24 5 * 6 = 30 6 * 6 = 36
# 1 * 7 = 7 2 * 7 = 14 3 * 7 = 21 4 * 7 = 28 5 * 7 = 35 6 * 7 = 42 7 * 7 = 49
# 1 * 8 = 8 2 * 8 = 16 3 * 8 = 24 4 * 8 = 32 5 * 8 = 40 6 * 8 = 48 7 * 8 = 56 8 * 8 = 64
# 1 * 9 = 9 2 * 9 = 18 3 * 9 = 27 4 * 9 = 36 5 * 9 = 45 6 * 9 = 54 7 * 9 = 63 8 * 9 = 72 9 * 9 = 81

# 1）9行9列
# 2）下面一行比上一行多一列
row = 0
line = 0
while row < 9:
    row += 1
    while line < 9:
        line += 1
        print(row, "*", line, "=", row*line, "\t", end="")
        if row == line:
            line = 0
            print("")
            break




